Revit 2027 API
MathComparisonUtils.IsAlmostZero Method
 Checks if value is almost zero, using the internal tolerance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsAlmostZero(
	double value
)
Public Shared Function IsAlmostZero (
	value As Double
) As Boolean
public:
static bool IsAlmostZero(
	double value
)
static member IsAlmostZero :
        value : float -> bool
Parameters
value Double
 The value to check.
Return Value
Boolean
 True if value is almost zero, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The given value for value is not finite
See Also
Reference
MathComparisonUtils Class
Autodesk.Revit.DB Namespace